/* Alert text for Retro Synth audio file analysis in case another analysis is still ongoing */
"A wavetable is currently being created. Please try again after the creation process has finished." = "ระบบกำลังสร้างตารางเก็บคลื่นเสียงอยู่ในขณะนี้ โปรดลองอีกครั้งหลังจากเสร็จสิ้นกระบวนการสร้าง";

/* Alert text for Retro Synth audio file analysis result info */
"Timbral information for a single waveform was detected. Formant modulation is available, by switching the Modulation knob to “Formant”. The Shape 1 and Shape 2 knobs are not functional." = "ตรวจพบข้อมูลทิมบรอลสำหรับคลื่นเสียงเดี่ยว การกล้ำสัญญาณตัวกรองรูปแบบคลื่นสามารถใช้งานได้โดยการสลับปุ่มหมุนการกล้ำสัญญาณไปเป็น “ตัวกรองรูปแบบคลื่น” แต่ปุ่มหมุนรูปร่างที่ 1 และรูปร่างที่ 2 จะไม่สามารถใช้งานได้";

/* Alert text for Retro Synth audio file analysis result info on failure */
"To create a wavetable, the audio file must have a constant pitch, several pitched sections separated by silence, or one or more single cycle sections." = "ถ้าต้องการสร้างตารางเก็บคลื่นเสียง ไฟล์เสียงนั้นต้องมีระดับเสียงสูงต่ำที่คงที่ มีส่วนที่ตั้งระดับเสียงหลายส่วนที่แยกด้วยเสียงเงียบหรือส่วนเล่นวนเดี่ยวส่วนเดียวหรือหลายส่วน";

/* Alert text for Retro Synth audio file analysis result info on success */
"The new wavetable contains %d waveforms." = "ตารางเก็บคลื่นเสียงใหม่มีคลื่นเสียง %d คลื่น";

/* Alert title for Retro Synth audio file analysis in case another analysis is still ongoing */
"Wavetable Being Created" = "กำลังสร้างตารางเก็บคลื่นเสียง";

/* Alert title for Retro Synth audio file analysis result info */
"Wavetable Created With a Single Waveform" = "สร้างตารางเก็บคลื่นเสียงด้วยคลื่นเสียงเดี่ยว";

/* Alert title for Retro Synth audio file analysis result info on failure */
"Wavetable Not Created" = "ไม่ได้สร้างตารางเก็บคลื่นเสียง";

/* Alert title for Retro Synth audio file analysis result info on success */
"Wavetable Created" = "สร้างตารางเก็บคลื่นเสียงแล้ว";

/* Compressor side chain default menu item name */
"CompressorSideChainDefaultItemName" = "ภายใน";

/* Compressor side chain menu name */
"CompressorSideChainMenuName" = "โซ่ข้าง:";

/* ES1 synth side chain default menu item name */
"ES1SideChainDefaultItemName" = "ปิด";

/* ES1 synth side chain menu name */
"ES1SideChainMenuName" = "สัญญาณเสียงเข้าภายนอก:";

/* Flex analysis progress indicator detail info */
"Identification of Notes" = "รหัสประจำตัวของโน้ต";

/* Flex analysis progress indicator detail info */
"Pitch Analysis" = "การวิเคราะห์ระดับเสียงสูงต่ำ";

/* Flex analysis progress indicator info */
"Analyzing: %@" = "กำลังวิเคราะห์: %@";

/* Playback file alert */
"PlaybackFileNotFoundHeader" = "ข้อผิดพลาดในการเปิดไฟล์";

/* Playback file alert */
"PlaybackFileNotFoundMessage" = "ไม่พบไฟล์ที่คุณพยายามโหลด";

/* Playback file alert */
"PlaybackFileOpenErrorHeader" = "ข้อผิดพลาดในการเปิดไฟล์";

/* Playback file alert */
"PlaybackFileOpenErrorMessage" = "ไม่มีหน่วยความจำเพียงพอที่จะโหลดไฟล์ที่เลือก";

/* Playback file alert */
"PlaybackTempoMarkerErrorHeader" = "ไฟล์มีการเปลี่ยนเทมโป";

/* Playback file alert */
"PlaybackTempoMarkerErrorMessage" = "คำเตือน: หนึ่งไฟล์หรือมากกว่าที่คุณส่งออกมีเครื่องหมายการเปลี่ยนเทมโป MainStage เวอร์ชั่นนี้ไม่รองรับการเชื่อมข้อมูลไฟล์ที่มีการเปลี่ยนเทมโป";

/* Playback file alert */
"PlaybackTransientsErrorHeader" = "ข้อผิดพลาดในการเปิดไฟล์";

/* Playback file alert */
"PlaybackTransientsMessage" = "ส่วนพักชั่วคราวในไฟล์ที่เลือกได้ถูกซ่อนใน Logic Pro เปิดไฟล์ใน Logic Pro และเลิกซ่อนส่วนพักชั่วคราวก่อนที่จะเปิดไฟล์อีกครั้งในปลั๊กอิน";

/* Playback file alert */
"PlaybackUnknownErrorHeader" = "ข้อผิดพลาดที่ไม่ทราบสาเหตุ";

/* Playback file alert */
"PlaybackUnknownErrorMessage" = "ไม่สามารถเปิดไฟล์ที่เลือกได้";

/* Playback file alert */
"PlaybackUnsupportedFileHeader" = "รูปแบบไฟล์เสียงที่ไม่รองรับ";

/* Playback file alert */
"PlaybackUnsupportedFileMessage" = "ไฟล์เสียงที่คุณพยายามจะเพิ่มไม่ได้อยู่ในรูปแบบไฟล์ที่รองรับ แปลงไฟล์ให้อยู่ในรูปแบบที่รองรับโดยใช้ iTunes หรือแอพพลิเคชั่นเสียงอื่นๆ ก่อนที่จะเพิ่มไฟล์เสียงไปยังปลั๊กอินการเล่น";

/* suffix for file names not being loaded into SpaceDesigner */
"MissingFileSuffix" = " (ไฟล์สูญหาย)";
